In [9]:
import pandas

my_input=[2,3,4,5]

print(my_input)

[2, 3, 4, 5]

In [12]:
my_dimension=pandas.DataFrame(my_input) 

#A Pandas DataFrame is a 2 dimensional data structure, like a 2 dimensional array, or a table with rows and columns.
#dataframe is used to convert 1 Dimension list to 2Dimension list

print(my_dimension)
print(type(my_dimension))

   0
0  2
1  3
2  4
3  5
<class 'pandas.core.frame.DataFrame'>

In [26]:
list1=[[2,5,7],[9,8,6],[4,1,2]]
dimen=pandas.DataFrame(list1)
print(dimen)

   0  1  2
0  2  5  7
1  9  8  6
2  4  1  2

In [21]:
list2=[[1,'dog',4],[8,'cat','rat'],[7,9,2]]
dimension=pandas.DataFrame(list2)
print(dimension)

   0    1    2
0  1  dog    4
1  8  cat  rat
2  7    9    2

In [23]:
print(dimension.loc[1]) #to get specified rows

0      8
1    cat
2    rat
Name: 1, dtype: object

In [25]:
tup=((1,2,3),(4,7,5))
dimension=pandas.DataFrame(tup)
print(dimension)

   0  1  2
0  1  2  3
1  4  7  5

In [31]:
print(dimen)
print(" ")

#column wise addition
sum_of_list=dimen.sum()
print(sum_of_list)

print(" ")

#row wise addition
sum_of_list1=dimen.sum(axis=1)
print(sum_of_list1)

   0  1  2
0  2  5  7
1  9  8  6
2  4  1  2

0    15
1    14
2    15
dtype: int64

0    14
1    23
2     7
dtype: int64

In [32]:
#to give names to index
dimen_Index=pandas.DataFrame(list1,index=["a","b","c"],columns=["dog","cat","rat"])
print(dimen_Index)

   dog  cat  rat
a    2    5    7
b    9    8    6
c    4    1    2

In [34]:
data = {
  "calories": [420, 380, 390],
  "duration": [50, 40, 45]
}

#load data into a DataFrame object:
df = pandas.DataFrame(data,index=[1,2,3])
print(df)

   calories  duration
1       420        50
2       380        40
3       390        45

In [48]:
data1={"Names":["Dhoni","kohli","ABD"],"Team":["csk","rcb","rcb"]}
df1=pandas.DataFrame(data1,index=["player1","player2","player3"])
print(df1)
print(" ")
print(df1.loc["player1"]) #to get row using index value
print(" ")
print(df1.iloc[0,0]) #to get the value using position

         Names Team
player1  Dhoni  csk
player2  kohli  rcb
player3    ABD  rcb

Names    Dhoni
Team       csk
Name: player1, dtype: object

Dhoni

In [49]:
#to create a csv file
df1.to_csv("pandas_day1.csv")

In [56]:
#group by function
ipl_data = {'Team': ['Riders', 'Riders', 'Devils', 'Devils', 'Kings',
   'kings', 'Kings', 'Kings', 'Riders', 'Royals', 'Royals', 'Riders'],
   'Rank': [1, 2, 2, 3, 3,4 ,1 ,1,2 , 4,1,2],
   'Year': [2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
   'Points':[876,789,863,673,741,812,756,788,694,701,804,690]}
dfa = pandas.DataFrame(ipl_data)
print(dfa)

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
2   Devils     2  2014     863
3   Devils     3  2015     673
4    Kings     3  2014     741
5    kings     4  2015     812
6    Kings     1  2016     756
7    Kings     1  2017     788
8   Riders     2  2016     694
9   Royals     4  2014     701
10  Royals     1  2015     804
11  Riders     2  2017     690

In [59]:
#To group by single column
print(dfa.groupby('Team',).groups)

{'Devils': [2, 3], 'Kings': [4, 6, 7], 'Riders': [0, 1, 8, 11], 'Royals': [9, 10], 'kings': [5]}

In [62]:
#To group by multiple columns
print(dfa.groupby(['Team','Year']).groups)

{('Devils', 2014): [2], ('Devils', 2015): [3], ('Kings', 2014): [4], ('Kings', 2016): [6], ('Kings', 2017): [7], ('Riders', 2014): [0], ('Riders', 2015): [1], ('Riders', 2016): [8], ('Riders', 2017): [11], ('Royals', 2014): [9], ('Royals', 2015): [10], ('kings', 2015): [5]}

In [4]:
import pandas as pd

file=pd.read_csv('nba.csv')
print(file)

              Name            Team  Number Position   Age Height  Weight  \
0    Avery Bradley  Boston Celtics     0.0       PG  25.0    6-2   180.0
1      Jae Crowder  Boston Celtics    99.0       SF  25.0    6-6   235.0
2     John Holland  Boston Celtics    30.0       SG  27.0    6-5   205.0
3      R.J. Hunter  Boston Celtics    28.0       SG  22.0    6-5   185.0
4    Jonas Jerebko  Boston Celtics     8.0       PF  29.0   6-10   231.0
..             ...             ...     ...      ...   ...    ...     ...
453   Shelvin Mack       Utah Jazz     8.0       PG  26.0    6-3   203.0
454      Raul Neto       Utah Jazz    25.0       PG  24.0    6-1   179.0
455   Tibor Pleiss       Utah Jazz    21.0        C  26.0    7-3   256.0
456    Jeff Withey       Utah Jazz    24.0        C  26.0    7-0   231.0
457            NaN             NaN     NaN      NaN   NaN    NaN     NaN

               College     Salary
0                Texas  7730337.0
1            Marquette  6796117.0
2    Boston University        NaN
3        Georgia State  1148640.0
4                  NaN  5000000.0
..                 ...        ...
453             Butler  2433333.0
454                NaN   900000.0
455                NaN  2900000.0
456             Kansas   947276.0
457                NaN        NaN

[458 rows x 9 columns]

In [69]:
print(file.groupby(['Name','Team'],sort=True).first())

                                        Number Position   Age Height  Weight  \
Name            Team
Aaron Brooks    Chicago Bulls              0.0       PG  31.0    6-0   161.0
Aaron Gordon    Orlando Magic              0.0       PF  20.0    6-9   220.0
Aaron Harrison  Charlotte Hornets          9.0       SG  21.0    6-6   210.0
Adreian Payne   Minnesota Timberwolves    33.0       PF  25.0   6-10   237.0
Al Horford      Atlanta Hawks             15.0        C  30.0   6-10   245.0
...                                        ...      ...   ...    ...     ...
Wilson Chandler Denver Nuggets            21.0       SF  29.0    6-8   225.0
Xavier Munford  Memphis Grizzlies         14.0       PG  24.0    6-3   180.0
Zach LaVine     Minnesota Timberwolves     8.0       PG  21.0    6-5   189.0
Zach Randolph   Memphis Grizzlies         50.0       PF  34.0    6-9   260.0
Zaza Pachulia   Dallas Mavericks          27.0        C  32.0   6-11   275.0

                                               College      Salary
Name            Team
Aaron Brooks    Chicago Bulls                   Oregon   2250000.0
Aaron Gordon    Orlando Magic                  Arizona   4171680.0
Aaron Harrison  Charlotte Hornets             Kentucky    525093.0
Adreian Payne   Minnesota Timberwolves  Michigan State   1938840.0
Al Horford      Atlanta Hawks                  Florida  12000000.0
...                                                ...         ...
Wilson Chandler Denver Nuggets                  DePaul  10449438.0
Xavier Munford  Memphis Grizzlies         Rhode Island         NaN
Zach LaVine     Minnesota Timberwolves            UCLA   2148360.0
Zach Randolph   Memphis Grizzlies       Michigan State   9638555.0
Zaza Pachulia   Dallas Mavericks                  None   5200000.0

[457 rows x 7 columns]

In [97]:
file.groupby('Team')["Age"].mean()

Team
Atlanta Hawks             28.200000
Boston Celtics            24.733333
Brooklyn Nets             25.600000
Charlotte Hornets         26.133333
Chicago Bulls             27.400000
Cleveland Cavaliers       29.533333
Dallas Mavericks          29.733333
Denver Nuggets            25.733333
Detroit Pistons           26.200000
Golden State Warriors     27.666667
Houston Rockets           26.866667
Indiana Pacers            26.400000
Los Angeles Clippers      29.466667
Los Angeles Lakers        27.533333
Memphis Grizzlies         28.388889
Miami Heat                28.933333
Milwaukee Bucks           24.562500
Minnesota Timberwolves    26.357143
New Orleans Pelicans      26.894737
New York Knicks           27.000000
Oklahoma City Thunder     27.066667
Orlando Magic             25.071429
Philadelphia 76ers        24.600000
Phoenix Suns              25.866667
Portland Trail Blazers    25.066667
Sacramento Kings          26.800000
San Antonio Spurs         31.600000
Toronto Raptors           26.133333
Utah Jazz                 24.466667
Washington Wizards        27.866667
Name: Age, dtype: float64

In [73]:
meanAge=file.groupby('Age').mean()
print(meanAge)

         Number      Weight        Salary
Age
19.0  10.500000  204.000000  1.930440e+06
20.0  17.210526  223.736842  2.725791e+06
21.0  18.315789  220.894737  2.067380e+06
22.0  14.423077  224.230769  2.357963e+06
23.0  19.682927  214.048780  2.034746e+06
24.0  16.468085  216.744681  3.785300e+06
25.0  19.866667  214.333333  3.930867e+06
26.0  17.277778  228.500000  6.866566e+06
27.0  18.682927  220.463415  6.676741e+06
28.0  19.741935  222.967742  5.110189e+06
29.0  16.892857  233.321429  6.224177e+06
30.0  12.032258  214.645161  7.061859e+06
31.0  12.681818  229.772727  8.511397e+06
32.0  12.846154  220.846154  7.716958e+06
33.0  23.571429  226.357143  3.930739e+06
34.0  23.500000  227.300000  7.606030e+06
35.0  19.666667  229.222222  3.461740e+06
36.0  19.700000  222.100000  2.238120e+06
37.0  28.500000  239.000000  1.277778e+07
38.0  24.500000  218.750000  1.840041e+06
39.0  12.000000  202.500000  2.517872e+06
40.0  22.000000  230.000000  4.666917e+06

In [93]:
data5={"runs":[1,2,3,4,5,6],"score":[90,43,23,65,43,51],"player":["dhoni","kohli","abd","gayle","abd","kohli"]}
df1=pd.DataFrame(data5)
df1.groupby(["player"]).mean() #this will give the mean of all the column values

        runs  score
player
abd        4     33
dhoni      1     90
gayle      4     65
kohli      4     47

In [94]:
df1.groupby(["player"])["score"].mean() #this will give the mean of only the specified column

player
abd      33
dhoni    90
gayle    65
kohli    47
Name: score, dtype: int64

In [89]:
df1.sort_values("score")

   runs  score player
2     3     23    abd
1     2     43  kohli
4     5     43    abd
5     6     51  kohli
3     4     65  gayle
0     1     90  dhoni

df1.groupby(["player"])["score"].sum()

In [96]:
df1.groupby(["player"])["score"].sum()

player
abd      66
dhoni    90
gayle    65
kohli    94
Name: score, dtype: int64

In [99]:
#removes empty cells
file.dropna(inplace=True)

In [100]:
#replaces empty cells with the value specified ie 130
file.fillna(130, inplace = True)

In [3]:
for x in file.index:
  if file.loc[x, "Age"] > 30:
    file.loc[x, "Age"] = 30
file.groupby('Age').mean()

NameError: name 'file' is not defined

In [106]:
if 'Aaron Brooks' in file.values :
    print("\nThis value exists in Dataframe")
 
else :
    print("\nThis value does not exists in Dataframe")

This value exists in Dataframe

In [6]:

file["Age"]= file["Age"].astype(str)
start, stop, step = 0, -2, 1
file["Age(int)"]= file["Age"].str.slice(start, stop, step)
  
file.head(10)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary,Age(int)
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0,25
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0,25
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN,27
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0,22
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0,29
5,Amir Johnson,Boston Celtics,90.0,PF,29.0,6-9,240.0,NaN,12000000.0,29
6,Jordan Mickey,Boston Celtics,55.0,PF,21.0,6-8,235.0,LSU,1170960.0,21
7,Kelly Olynyk,Boston Celtics,41.0,C,25.0,7-0,238.0,Gonzaga,2165160.0,25
8,Terry Rozier,Boston Celtics,12.0,PG,22.0,6-2,190.0,Louisville,1824360.0,22
9,Marcus Smart,Boston Celtics,36.0,PG,22.0,6-4,220.0,Oklahoma State,3431040.0,22